[
  {
    "groupName": "Appetizers",
    "items": [
      {
        "name": "Nachos",
        "description" : "Monterey jack cheese sauce, tomato, lettuce, black olives, onions, jalapeños, sour cream and salsa",
        "price": 8.99,
        "addOns": [
          {
            "name": "Beef or Chicken",
            "price": 11.99
          },
          {
            "name": "Pork",
            "price": 12.99
          }
        ]
      },
      {
        "name": "Cheese Curds",
        "description" : "White or yellow. Served with a side of ranch",
        "price": 8.99
      },
      {
        "name": "Boneless Wings",
        "description" : "Choice of buffalo, chipotle BBQ, sweet & tangy BBQ or teriyaki sauce",
        "price": 8.99
      },
      {
        "name": "Chicken Strips",
        "description" : "4 pieces, served with choice of sauce",
        "price": 7.99
      },
      {
        "name": "Pretzel Bites",
        "description" : "Soft pretzel bites served with Monterey jack cheese sauce or honey mustard",
        "price": 8.99
      },
      {
        "name": "Onion Rings",
        "description" : "Thick sliced onions hand battered and deep fried to perfection. Served with a side of bistro sauce",
        "price": 7.99
      },
      {
        "name": "Portabella Mushrooms",
        "description" : "Sliced portabellas hand battered and deep fried to perfection. Served with a side of ranch",
        "price": 8.99
      },
      {
        "name": "Pickle Chips",
        "description" : "Pickle chips lightly seasoned with Cajun, hand battered and deep fried to perfection. Served with a side of ranch",
        "price": 7.99
      },
      {
        "name": "Hangover Fries",
        "description" : "Brew city fries topped with cheese sauce, bacon and bleu cheese crumbles",
        "price": 8.99
      },
      {
        "name": "Brew City Fries",
        "addOns": [
          {
            "name": "Small",
            "price": 3.99
          },
          {
            "name": "Large",
            "price": 6.99
          }
        ]
      },
      {
        "name": "Loaded Sweet Potato Fries",
        "description" : "Waffle cut sweet potato fries topped with bacon, jalapeños and a sweet & spicy secret sauce",
        "price": 8.99
      },
      {
        "name": "Quesadilla",
        "description" : "Cheddar cheese quesadilla loaded with jalapeños, tomato and black olives on flour tortillas served with salsa and sour cream",
        "price": 8.99,
        "addOns": [
          {
            "name": "Shredded Cajun Chicken",
            "price": 10.99
          },
          {
            "name": "Cajun Seasoned Shrimp",
            "price": 11.99
          },
          {
            "name": "Cajun Seasoned Shrimp",
            "price": 11.99
          }
        ]
      }
    ]
  },
  {
    "groupName": "Soups & Salads",
    "groupDescription": "Dressing: ranch, French, Italian, honey mustard, thousand island, bleu cheese, toasted sesame, Caesar, raspberry vinaigrette, balsamic vinaigrette",
    "layout": "2col",
    "items": [
      {
        "name": "Soup of the Day",
        "description" : "Seasonal: September through May",
        "price": 4.99
      },
      {
        "name": "Garden Salad",
        "description" : "Romaine lettuce, spring mix, tomato, onion, cucumber, green pepper and shredded cheddar cheese and croutons. Served with choice of dressing and garlic toast",
        "price": 8.99,
        "addOns": [
          {
            "name": "Crispy or Grilled Chicken",
            "price": 13.99
          },
          {
            "name": "Shrimp",
            "price": 14.99
          },
          {
            "name": "Salmon",
            "price": 17.99
          }
        ]
      },
      {
        "name": "Side Salad",
        "description" : "Romaine lettuce, spring mix, tomato, onion, cucumber and croutons",
        "price": 4.99
      },
      {
        "name": "Bleu Cheese Bacon Salad",
        "description" : "Romaine lettuce, spring mix, tomato, cucumber, bacon, bleu cheese crumbles and blackened chicken. Served with choice of dressing and garlic toast",
        "price": 12.99
      },
      {
        "name": "Caesar Salad",
        "description" : "Romaine lettuce, tomato, shredded parmesan cheese and croutons served with caesar dressing. Served with garlic toast",
        "price": 8.99,
        "addOns": [
          {
            "name": "Chicken",
            "price": 13.99
          },
          {
            "name": "Shrimp",
            "price": 14.99
          },
          {
            "name": "Salmon",
            "price": 17.99
          }
        ]
      }
    ]
  },
  {
    "groupName": "Burgers",
    "groupDescription": "Includes choice of brew city fries, kettle chips, homemade potato salad or cottage cheese. Substitute sweet potato fries, side salad or soup for $2.29.",
    "layout": "2col",
    "items": [
      {
        "name": "The Triple B",
        "description" : "Brisket, bacon, burger... a meat lovers delight. A slow smoked brisket tops a 1/3 pound burger with bacon, chipotle BBQ sauce and three onion rings",
        "price": 17.99
      },
      {
        "name": "Western Burger",
        "description" : "1/3 pound patty smothered in chipotle BBQ with swiss cheese, bacon and onion rings on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Heart Attack Burger",
        "description" : "1/3 pound burger topped with fried onions and bacon served between two grilled cheese sandwiches",
        "price": 15.99
      },
      {
        "name": "Breakfast Burger",
        "description" : "1/3 pound patty topped with cheddar, bacon, fried egg, fried onions and a hash brown served on a sourdough bun",
        "price": 14.99
      },
      {
        "name": "Dallas Burger",
        "description" : "1/3 pound patty topped with bacon, cheddar cheese, coleslaw, deep fried pickles and cajun seasoning served on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Santa Fe Burger",
        "description" : "1/3 pound patty topped with bacon, sautéed jalapeños, pepper jack cheese and ancho chipotle ranch sauce served on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Jalapeño Popper Burger",
        "description" : "1/3 pound patty with sautéed jalapeños, fried onions, and topped with cream cheese on a sourdough bun with a side of hot sauce",
        "price": 13.99
      },
      {
        "name": "Soooo Gouda Burger",
        "description" : "1/3 pound burger patty topped with smoked Gouda, bacon, portabellas, spring mix and a garlic tarragon aioli served on a ciabatta bun",
        "price": 16.99
      }
    ]
  },
  {
    "groupName": "Sandwiches, Wraps & More",
    "groupDescription": "Includes choice of brew city fries, kettle chips, homemade potato salad or cottage cheese. Substitute sweet potato fries, side salad or soup for $2.29",
    "layout": "2col",
    "items": [
      {
        "name": "Shrimp Po Boy Wrap",
        "description" : "Deep fried popcorn shrimp, cheddar cheese, lettuce, tomato and jalapeño aioli served in a garlic herb wrap",
        "price": 13.99
      },
      {
        "name": "Fish Reuben",
        "description" : "Three pieces of haddock blackened topped with coleslaw, Swiss cheese and ancho chipotle sauce served on grilled rye bread",
        "price": 13.99
      },
      {
        "name": "BLT",
        "description" : "Everyone’s favorite, bacon, lettuce and tomato with mayo on toasted sourdough bread. Try it on a focaccia bun for $1.00 more",
        "price": 10.99
      },
      {
        "name": "Shrimp Tacos",
        "description" : "Two tortilla shells filled with shrimp, cheddar cheese, lettuce and tomato topped with ancho chipotle sauce",
        "price": 13.99
      },
      {
        "name": "Salmon BLT",
        "description" : "Grilled salmon, bacon, lettuce and tomato served on a focaccia bun with a side of bistro sauce",
        "price": 18.99
      },
      {
        "name": "Fish Tacos",
        "description" : "Two tortilla shells filled with fish, cheddar cheese, lettuce and tomato topped with ancho chipotle sauce",
        "price": 12.99
      },
      {
        "name": "Philly Cheese Steak",
        "description" : "Sliced steak, fried onions, green peppers and mozzarella cheese served on a hoagie bun",
        "price": 13.99
      },
      {
        "name": "Beef Brisket Tacos",
        "description" : "Two tortilla shells filled with smoked beef brisket, cheddar cheese and cole slaw topped with chipotle BBQ sauce",
        "price": 13.99
      },
      {
        "name": "Fire Braised BBQ Pork",
        "description" : "A heaping half pound of slow roasted fire braised pork loin topped with chipotle BBQ sauce and cole slaw served on a ciabatta roll",
        "price": 13.99
      },
      {
        "name": "Beer Battered Fish Sandwich",
        "description" : "Two pieces of beer battered haddock fish topped with cheddar cheese served on a sourdough bun with a side of tartar sauce",
        "price": 12.99
      },
      {
        "name": "Beef Brisket Grilled Cheese",
        "description" : "Grilled cheese sandwich stuffed with slow smoked beef brisket, fried onions and chipotle BBQ sauce",
        "price": 13.99
      },
      {
        "name": "Chicken Caesar Wrap",
        "description" : "Romaine lettuce, tomato, shredded parmesan cheese, grilled chicken and caesar dressing in a garlic herb wrap",
        "price": 13.99
      },
      {
        "name": "Pulled Pork Grilled Cheese",
        "description" : "Grilled cheese sandwich stuffed with pulled pork, fried onions, american cheese, and balsamic glaze",
        "price": 13.99
      },
      {
        "name": "Shrimp Wrap",
        "description" : "Deep fried popcorn shrimp, cheddar cheese, lettuce, tomato and ancho chipotle sauce in a garlic herb wrap",
        "price": 13.99
      },
      {
        "name": "Southwest Chicken",
        "description" : "Fried chicken breast topped with pepper jack cheese, bacon and ancho chipotle sauce served on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Chicken Fajita Wrap",
        "description" : "Shredded chicken, green peppers and onions topped with cheese sauce wrapped and grilled in a garlic herb wrap. Served with salsa and sour cream",
        "price": 13.99
      },
      {
        "name": "Pesto Chicken",
        "description" : "Grilled chicken breast topped with pesto sauce and mozzarella cheese served on a focaccia bun and a side of pesto mayo",
        "price": 13.99
      },
      {
        "name": "Buffalo Chicken Wrap",
        "description" : "Fried chicken diced and tossed with romaine lettuce, spring mix, tomato, bleu cheese crumbles and buffalo sauce in a garlic herb wrap",
        "price": 13.99
      },
      {
        "name": "Roasted Red Pepper Chicken",
        "description" : "Grilled chicken breast topped with roasted red peppers, popper jack cheese and ranch dressing served on a focaccia bun",
        "price": 13.99
      }
    ]
  }
]