[
  {
    "groupName": "Appetizers",
    "layout": "2col",
    "items": [
      {
        "name": "Cheese Curds",
        "description" : "White or yellow. Served with a side of ranch",
        "price": 8.99
      },
      {
        "name": "Boneless Wings",
        "description" : "Choice of buffalo, chipotle BBQ, sweet & tangy BBQ or teriyaki sauce",
        "price": 9.99
      },
      {
        "name": "Hangover Fries",
        "description" : "Fries topped with cheese sauce, bacon and bleu cheese crumbles",
        "price": 8.99
      },
      {
        "name": "Traditional Wings",
        "description" : "Bone-in wings tossed in your choice of sauce: sweet and tangy BBQ, Chipotle BBQ, Buffalo or Teriyaki.",
        "addOns": [
          {
            "name": "6 Wings",
            "price": 9.99
          },
          {
            "name": "12 Wings",
            "price": 16.99
          }
        ]
      },
      {
        "name": "Pretzel Bites",
        "description" : "Soft pretzel bites served with Monterey jack cheese sauce or honey mustard",
        "price": 8.99
      },
      {
        "name": "Pickle Chips",
        "description" : "Pickle chips lightly seasoned with Cajun, hand battered and deep fried to perfection. Served with a side of ranch",
        "price": 7.99
      },
      {
        "name": "Onion Rings",
        "description" : "Thick sliced onions hand battered and deep fried to perfection. Served with a side of bistro sauce",
        "price": 7.99
      },
      {
        "name": "Nachos",
        "description" : "Monterey jack cheese sauce, tomato, lettuce, black olives, onions, jalapeños, sour cream and salsa",
        "price": 8.99,
        "addOns": [
          {
            "name": "Beef or Chicken",
            "price": 11.99
          },
          {
            "name": "Pork",
            "price": 12.99
          }
        ]
      },
      {
        "name": "Portabella Mushrooms",
        "description" : "Sliced portabellas hand battered and deep fried to perfection. Served with a side of ranch",
        "price": 8.99
      },
      {
        "name": "Chicken Strips",
        "description" : "4 pieces, served with choice of sauce",
        "price": 8.99
      }
    ]
  },
  {
    "groupName": "Quesadillas",
    "items": [
      {
        "name": "Veggie",
        "description" : "Cheddar cheese quesadilla loaded with jalapeños, tomato and black olives on flour tortillas drizzled with ancho chipotle sauce",
        "price": 8.99,
        "addOns": [
          {
            "name": "Shredded Cajun Chicken",
            "price": 10.99
          },
          {
            "name": "Shrimp",
            "price": 11.99
          }
        ]
      },
      {
        "name": "Spicy CBR",
        "description" : "Quesadilla loaded with shredded cajun chicken, bacon, tomato, cheddar cheese and drizzled with ranch dressing on flour tortillas",
        "price": 10.99
      },
      {
        "name": "BBQ Pork",
        "description" : "Quesadilla loaded with shredded pork, cheddar cheese, jalapenos, tomato, drizzled with chipotle BBQ sauce on flour tortillas",
        "price": 11.99
      }
    ]
  },
  {
    "groupName": "Sandwiches & Wraps",
    "groupDescription": "Includes choice of fries, kettle chips, homemade potato salad or cottage cheese. Substitute sweet potato fries, side salad or soup for $2.29",
    "layout": "3col",
    "items": [
      {
        "name": "French Dip",
        "description" : "6oz. thinly sliced beef topped with mozzarella cheese served on a hoagie bun and a side of au jus",
        "price": 14.99,
        "addOns": [
          {
            "name": "add onions, jalapeños, green peppers or mushrooms (price per item)",
            "price": 0.50
          }
        ]
      },
      {
        "name": "Chicken Caesar Wrap",
        "description" : "Romaine lettuce, tomato, shredded parmesan cheese, grilled chicken and caesar dressing in a garlic herb wrap",
        "price": 13.99
      },
      {
        "name": "Fish Tacos",
        "description" : "Two tortilla shells filled with fish, cheddar cheese, lettuce and tomato topped with ancho chipotle sauce.  Served with salsa and sour cream pon request",
        "price": 12.99
      },
      {
        "name": "Pulled Pork Grilled Cheese",
        "description" : "Grilled cheese sandwich stuffed with pulled pork, fried onions, american cheese, and balsamic glaze",
        "price": 13.99
      },
      {
        "name": "Chicken Fajita Wrap",
        "description" : "Shredded chicken, green peppers and onions topped with cheese sauce wrapped and grilled in a garlic herb wrap. Served with salsa and sour cream",
        "price": 13.99
      },
      {
        "name": "Beer Battered Fish Sandwich",
        "description" : "Two pieces of beer battered haddock fish topped with cheddar cheese served on a sourdough bun with a side of tartar sauce",
        "price": 12.99
      },
      {
        "name": "Nacho Grilled Cheese",
        "description" : "Grilled cheese sandwich stuffed with seasoned beef, tortilla chips, cheddar cheese, lettuce, tomato, black olives, and jalapenos served with a side of cheese sauce",
        "price": 13.99
      },
      {
        "name": "Pulled Pork Wrap",
        "description" : "Pulled pork topped with balsamic glaze, jalapeño siracha slaw and tomato, all wrapped up in our garlic herb wrap",
        "price": 13.99
      },
      {
        "name": "Fire Braised BBQ Pork",
        "description" : "A heaping half pound of slow roasted fire braised pork loin topped with chipotle BBQ sauce and cole slaw served on a ciabatta roll",
        "price": 13.99
      },
      {
        "name": "Fish Reuben",
        "description" : "Three pieces of haddock blackened topped with coleslaw, Swiss cheese and ancho chipotle sauce served on grilled rye bread",
        "price": 13.99
      },
      {
        "name": "Shrimp Tacos",
        "description" : "Two tortilla shells filled with shrimp, cheddar cheese, lettuce and tomato topped with ancho chipotle sauce. Served with sour cream and salsa upon request.",
        "price": 13.99
      }
    ]
  },
  {
    "groupName": "Burgers",
    "groupDescription": "Includes choice of fries, kettle chips, homemade potato salad or cottage cheese. Substitute sweet potato fries, side salad or soup for $2.29.",
    "layout": "3col",
    "items": [
      {
        "name": "Western Burger",
        "description" : "1/3 pound patty smothered in chipotle BBQ with swiss cheese, bacon and onion rings on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Jalapeño Popper Burger",
        "description" : "1/3 pound patty with sautéed jalapeños, fried onions, and topped with cream cheese on a sourdough bun with a side of hot sauce",
        "price": 13.99
      },
      {
        "name": "Breakfast Burger",
        "description" : "1/3 pound patty topped with cheddar, bacon, fried egg, fried onions and a hash brown served on a sourdough bun",
        "price": 14.99
      },
      {
        "name": "Dallas Burger",
        "description" : "1/3 pound patty topped with bacon, cheddar cheese, coleslaw, deep fried pickles and cajun seasoning served on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Sweet Potato Fry Burger",
        "description" : "1/3 pound patty topped with Bleu cheese, bacon, fried onions, sweet potato fries and our homemade sweet & spicy sauce served on a chibatta bun",
        "price": 15.99
      },
      {
        "name": "Classic Burger",
        "description" : "1/3 pound burger patty served on a sourdough bun.",
        "price": 11.99,
        "addOns": [
          {
            "name": "Make it a Veggie Burger",
            "price": 12.99
          },
          {
            "name": "Cheese",
            "price": 1.00
          },
          {
            "name": "Bacon",
            "price": 2.00
          },
          {
            "name": "Fried Egg",
            "price": 1.00
          },
          {
            "name": "Other Toppings",
            "price": 0.50
          }
        ]
      },
      {
        "name": "Peanut Butter and Jam Burger",
        "description" : "1/3 pound burger patty topped with peanut butter, bacon habanero jam, fried onion and jalapenos served on a ciabatta bun",
        "price": 14.99
      },
      {
        "name": "Santa Fe Burger",
        "description" : "1/3 pound patty topped with bacon, sautéed jalapeños, pepper jack cheese and ancho chipotle ranch sauce served on a sourdough bun",
        "price": 13.99
      }
    ]
  },
  {
    "groupName": "Chicken",
    "groupDescription": "Includes choice of fries, kettle chips, homemade potato salad or cottage cheese. Substitute sweet potato fries, side salad or soup for $2.29.",
    "layout": "3col",
    "items": [
      {
        "name": "Southwest Chicken",
        "description" : "Fried chicken breast topped with pepper jack cheese, bacon and ancho chipotle sauce served on a sourdough bun",
        "price": 13.99
      },
      {
        "name": "Garlic Parm Chicken",
        "description" : "Grilled chicken breast topped with fried onions, mozzarella cheese and garlic parm sauce served on a focaccia bun",
        "price": 13.99
      },
      {
        "name": "Nashville Hot Chicken",
        "description" : "Fried chicken breast smothered in Nashville Hot sauce, topped with jalapeño siracha slaw and pickles, served on a chibatta bun.",
        "price": 13.99
      },
      {
        "name": "Pesto Chicken",
        "description" : "Grilled chicken breast topped with pesto sauce and mozzarella cheese served on a focaccia bun and a side of pesto mayo",
        "price": 13.99
      },
      {
        "name": "Classic Chicken Sandwich",
        "description" : "Grilled or Fried served on a sourdough bun",
        "price": 11.99,
        "addOns": [
          {
            "name": "Make it a melt with cheese and bacon.",
            "price": 13.99
          }
        ]
      }
    ]
  },
  {
    "groupName": "Soups & Salads",
    "groupDescription": "All dressing served on the side.Your choice of: ranch, French, Italian, honey mustard, thousand island, bleu cheese, Caesar, raspberry vinaigrette, balsamic vinaigrette",
    "layout": "2col",
    "items": [
      {
        "name": "Soup of the Day",
        "description" : "Seasonal: September through May"
      },
      {
        "name": "Caesar Salad",
        "description" : "Romaine lettuce, tomato, shredded parmesan cheese and croutons served with caesar dressing. Served with garlic toast",
        "price": 8.99,
        "addOns": [
          {
            "name": "Chicken",
            "price": 13.99
          },
          {
            "name": "Shrimp",
            "price": 14.99
          },
          {
            "name": "Salmon",
            "price": 17.99
          }
        ]
      },
      {
        "name": "Side Salad",
        "description" : "Romaine lettuce, spring mix, tomato, onion, cucumber and croutons",
        "price": 4.99
      },
      {
        "name": "Garden Salad",
        "description" : "Romaine lettuce, spring mix, tomato, onion, cucumber, green pepper and shredded cheddar cheese and croutons. Served with choice of dressing and garlic toast",
        "price": 8.99,
        "addOns": [
          {
            "name": "Crispy or Grilled Chicken",
            "price": 13.99
          },
          {
            "name": "Shrimp",
            "price": 14.99
          },
          {
            "name": "Salmon",
            "price": 17.99
          }
        ]
      },
      {
        "name": "Bleu Cheese Bacon Salad",
        "description" : "Romaine lettuce, spring mix, tomato, cucumber, bacon, bleu cheese crumbles and blackened chicken. Served with choice of dressing and garlic toast",
        "price": 13.99
      }
    ]
  }
]